README.org
#+TITLE: Via

* Description
Via is a systems package manager written in go language. It's primary purpose is
is to download and install binary packages.  It uses json based plans to
download and build the packages. The packages once installed do not effect the
host system. And can be run on most modern Linux systems.


* Installing the via binary
#+begin_src sh
go get bitbucket.org/strings/via
#+end_src

* Installing a package
#+begin_src sh
via install bash
#+end_src

* Build bash
#+begin_src sh
via -c build bash
#+end_src

* Installing the development group
#+begin_src sh
via install devel
#+end_src
